# EA_ConvX2DocStr

## Description
Converts value from X unit to document unit and returns the result as real number.

```pascal
FUNCTION EA_ConvX2DocStr(
				unitType    : INTEGER;
				value       : REAL;
				incUnitMark : BOOLEAN): STRING;
```

```python
def vs.EA_ConvX2DocStr(unitType, value, incUnitMark):
    return STRING
```

## Parameters
|Name|Type|Description|
|---|---|---|
|unitType|INTEGER|   |
|value|REAL|   |
|incUnitMark|BOOLEAN|   |

## Version
Availability: from Vectorworks 2016

## Category
* EnergyAnalysis Interface Library